#####################################
########中美普克  原价成本是757.153198
########中美普克  零售成本是753.648376
########中美普克  活动成本是 小于753.6483676
########泽牧久远  固定成本(无优惠) 758.245483
########中粮集团  固定成本(无优惠) 776.222473
#育雏 6150元每吨   153.75一包  3.075一斤   暂不确定是否包邮
#育成 6650元每吨   166.25一包  4.156一斤   暂不确定是否包邮
#产蛋 6650元每吨   166.25一包  4.156一斤   暂不确定是否包邮

#当期如果选择中粮5%  2包产蛋(715)  15包育雏(705M)   23包育成(705S)
#如果选择中美普克2%  1包产蛋       8包育雏          11包育成

#!/bin/sh

if [ $1 -eq "zhongmei" ];then
gcc 1.c -D UNITPRICE
echo "中美普克育雏0-3月"
gcc 1.c -D UNITPRICE
# ./a.out 0.56 1.25 0.33 1.7 0.052 1.07 0.006 0.3 0.015 2.3 0.017 0 0.02 7.35
./a.out 0.56 1.25 0.33 1.7 0.052 1.07 0.006 0.3 0.015 2.3 0.017 0 0.02 7
echo "中美普克育雏3-6月"
gcc 1.c -D UNITPRICE
# ./a.out 0.55 1.25 0.28 1.7 0.115 1.07 0.006 0.3 0.01 2.3 0.019 0 0.02 7.35
./a.out 0.55 1.25 0.28 1.7 0.115 1.07 0.006 0.3 0.01 2.3 0.019 0 0.02 7
echo "中美普克育雏7-8月"
gcc 1.c -D UNITPRICE
# ./a.out 0.63 1.25 0.24 1.7 0.082 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.6
./a.out 0.63 1.25 0.24 1.7 0.082 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.27725
echo "中美普克育雏9月以上"
gcc 1.c -D UNITPRICE
# ./a.out 0.69 1.25 0.22 1.7 0.042 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.6
./a.out 0.69 1.25 0.22 1.7 0.042 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.27725
echo "中美普克产蛋期"
gcc 1.c -D UNITPRICE
# ./a.out 0.56 1.25 0.31 1.7 0.036 1.07 0.006 0.3 0.008 2.3 0.06 0 0.02 7.1
./a.out 0.56 1.25 0.31 1.7 0.036 1.07 0.006 0.3 0.008 2.3 0.06 0 0.02 6.762
echo "中美普克休产期"
gcc 1.c -D UNITPRICE
# ./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.6
./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.277
gcc 1.c -D ALLPRICE
echo "中美普克养殖一只鸟到10.5月需要成本:757.153198(原价成本)"
echo "中美普克养殖一只鸟到10.5月需要成本:753.648376(零售成本)"
# ./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.6


gcc 1.c -D UNITPRICE
echo "泽牧久远育雏0-3月"
gcc 1.c -D UNITPRICE
./a.out 0.56 1.25 0.33 1.7 0.052 1.07 0.006 0.3 0.015 2.3 0.017 0 0.02 7.5
echo "泽牧久远育雏3-6月"
gcc 1.c -D UNITPRICE
./a.out 0.55 1.25 0.28 1.7 0.114 1.07 0.006 0.3 0.01 2.3 0.02 0 0.02 7.5
echo "泽牧久远育雏7-8月"
gcc 1.c -D UNITPRICE
./a.out 0.63 1.25 0.24 1.7 0.082 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.7
echo "泽牧久远育雏9月以上"
gcc 1.c -D UNITPRICE
./a.out 0.69 1.25 0.22 1.7 0.042 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.7
echo "泽牧久远产蛋期"
gcc 1.c -D UNITPRICE
./a.out 0.56 1.25 0.31 1.7 0.036 1.07 0.006 0.3 0.008 2.3 0.06 0 0.02 7.2
echo "泽牧久远休产期"
gcc 1.c -D UNITPRICE
./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.7
gcc 1.c -D ALLPRICE
echo "泽牧久远养殖一只鸟到10.5月需要成本:758.245483(原价成本)"
# ./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.6





else


#育雏 6150元每吨   153.75一包  3.075一斤   暂不确定是否包邮
#育成 6650元每吨   166.25一包  4.156一斤   暂不确定是否包邮
#产蛋 6650元每吨   166.25一包  4.156一斤   暂不确定是否包邮



gcc 1.c -D UNITPRICE
echo "中粮集团育雏0-3月"
gcc 1.c -D UNITPRICE
# ./a.out 0.56 1.25 0.33 1.7 0.052 1.07 0.006 0.3 0.015 2.3 0.017 0 0.02 7.35
./a.out 0.60 1.25 0.34 1.7 0 1.07 0 0.3 0.000 2.3 0.000 0 0.05 3.075
echo "中粮集团育雏3-6月"
gcc 1.c -D UNITPRICE
# ./a.out 0.55 1.25 0.28 1.7 0.115 1.07 0.006 0.3 0.01 2.3 0.019 0 0.02 7.35
./a.out 0.60 1.25 0.34 1.7 0 1.07 0 0.3 0.000 2.3 0.000 0 0.05 3.075
echo "中粮集团育雏7-8月"
gcc 1.c -D UNITPRICE
# ./a.out 0.63 1.25 0.24 1.7 0.082 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.6
./a.out 0.63 1.25 0.20 1.7 0.12 1.07 0.000 0.3 0 2.3 0.0 0 0.05 4.15623
echo "中粮集团育雏9月以上"
gcc 1.c -D UNITPRICE
# ./a.out 0.69 1.25 0.22 1.7 0.042 1.07 0.006 0.3 0 2.3 0.022 0 0.02 6.6
./a.out 0.63 1.25 0.20 1.7 0.12 1.07 0.000 0.3 0 2.3 0.0 0 0.05 4.15623
echo "中粮集团产蛋期"
gcc 1.c -D UNITPRICE
# ./a.out 0.56 1.25 0.31 1.7 0.036 1.07 0.006 0.3 0.008 2.3 0.06 0 0.02 7.1
./a.out 0.55 1.25 0.31 1.7 0.04 1.07 0.000 0.3 0.000 2.3 0.05 0 0.05 4.15623
echo "中粮集团休产期"
gcc 1.c -D UNITPRICE
# ./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.6
./a.out 0.55 1.25 0.31 1.7 0.04 1.07 0.000 0.3 0.000 2.3 0.05 0 0.05 4.15623
gcc 1.c -D ALLPRICE
echo "中粮集团养殖一只鸟到10.5月需要成本:776.222473(原价成本)"
echo "中粮集团养殖一只鸟到10.5月需要成本:776.222473(零售成本)"
# ./a.out 0.55 1.25 0.21 1.7 0.197 1.07 0.006 0.3 0 2.3 0.017 0 0.02 6.6

fi
